Revit 2027 API
CableTray.CurveNormal Property
 The up-direction vector of the cable tray.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ CurveNormal { get; set; }
Public Property CurveNormal As XYZ
	Get
	Set
public:
property XYZ^ CurveNormal {
	XYZ^ get ();
	void set (XYZ^ value);
}
member CurveNormal : XYZ with get, set
Property Value
XYZ
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
CableTray Class
Autodesk.Revit.DB.Electrical Namespace